eewiki/WeatherStation/Weather_mikroe_SAM3X/flip_click_defs.h
#ifndef FLIP_CLICK_DEFS_H
#define FLIP_CLICK_DEFS_H

/***************
 *** Click D ***
 ***************/
#define D_AN   57
#define D_RST  36
#define D_CS   78
#define D_SCK  76
#define D_MISO 74
#define D_MOSI 75

#define D_PWM  9
#define D_INT  29
#define D_RX   15
#define D_TX   14
#define D_I2C1_SCL 21
#define D_I2C1_SDA 20

/***************
 *** Click C ***
 ***************/
#define C_AN   56
#define C_RST  35
#define C_CS   52
#define C_SCK  76
#define C_MISO 74
#define C_MOSI 75

#define C_PWM  8
#define C_INT  28
#define C_RX   15
#define C_TX   14
#define C_I2C1_SCL 21
#define C_I2C1_SDA 20

/***************
 *** Click B ***
 ***************/
#define B_AN   55
#define B_RST  34
#define B_CS   4
#define B_SCK  76
#define B_MISO 74
#define B_MOSI 75

#define B_PWM  7
#define B_INT  27
#define B_RX   15
#define B_TX   14
#define B_I2C1_SCL 71
#define B_I2C1_SDA 70

/***************
 *** Click A ***
 ***************/
#define A_AN   54
#define A_RST  33
#define A_CS   77
#define A_SCK  76
#define A_MISO 74
#define A_MOSI 75

#define A_PWM  6
#define A_INT  26
#define A_RX   15
#define A_TX   14
#define A_I2C1_SCL 71
#define A_I2C1_SDA 70

#endif
